CoreMaker-lab/RA4M2_IOT/RA4M2_IOT_Project8/src/hal_entry.c
#include "hal_data.h"
#include <stdio.h>
#include "lsm6dsv16x_reg.h"
#include "oled.h"
#include "bmp.h"
FSP_CPP_HEADER
void R_BSP_WarmStart(bsp_warm_start_event_t event);
FSP_CPP_FOOTER

/* UART0——涂鸦模块：单字节接收完成标志 */
volatile bool uart_wifi_RX_flag = false;
/* UART0——涂鸦模块：发送完成标志*/
volatile bool uart_wifi_TX_flag = false;
/* UART0 接收缓存大小*/
#define UART0_LENGTH  255
/* UART0 接收环形缓冲区*/
uint8_t  TUYA_wifi_buffer[UART0_LENGTH];
/* 已接收字节计数（环形缓存写指针）*/
uint32_t UART0_TUYA_LENGTH = 0;
/* 解析到一帧有效数据后置位，主循环里解析后需清零 */
uint32_t UART0_TUYA_flag = 0;

/*****************************************************************
 * UART0 回调：RX/TX/单字符事件处理
 *****************************************************************/
void user_uart_callback0(uart_callback_args_t *p_args)
{
    /* 整帧接收完成（需在 R_SCI_UART_Receive 调用后才会产生）*/
    if(p_args->event == UART_EVENT_RX_COMPLETE)
    {
        uart_wifi_RX_flag = true;
    }
    /* 发送完成 */
    else if(p_args->event == UART_EVENT_TX_COMPLETE)
    {
        uart_wifi_TX_flag = true;
    }
    /* 接收到 1 个字符*/
    else if(p_args->event == UART_EVENT_RX_CHAR)
    {
        /* 缓冲未满则写入*/
        if (sizeof(TUYA_wifi_buffer) > UART0_TUYA_LENGTH)
        {
            /* 仅在数据位 ≥ 8bit 时写入 1 字节 */
            if (UART_DATA_BITS_8 >= g_uart0_cfg.data_bits)
            {
                TUYA_wifi_buffer[UART0_TUYA_LENGTH++] = (uint8_t) p_args->data;
            }
            /* —— 以下为简单的涂鸦帧快速判定逻辑，可改为状态机 —— */
            /* 帧头非 0x55 则丢弃当前字节（回溯 1 位）*/
            if(TUYA_wifi_buffer[00]!=0x55)
                UART0_TUYA_LENGTH--;
            /* 普通指令帧长度 ≥ 7 且 CMD ≠ 0x07 时，即可认为一帧完 */
            if(UART0_TUYA_LENGTH>=7 && TUYA_wifi_buffer[3]!=0x06)
                UART0_TUYA_flag=1;
        }
    }
}

/*****************************************************************
 * 与涂鸦协议相关的工作变量／固定协议帧
 * *****************************************************************/

uint8_t wifi_first =0;/* 0：第一次心跳；1：第二次心跳     */
uint32_t wifi_num =0;//如果心跳频繁发送，可能是触发了复位，需要重新发送buff1，这里2秒内多次发送心跳指令则认为重启
/* ---- 固定格式下行帧：MCU 主动发送给涂鸦模块 ----------------- */
const uint8_t g_tuya_heartbeat1[8]={0x55,0xAA,0x03,0x00,0x00,0x01,0x00,0x03};//心跳检测,第1次 0x55 aa 00 00 00 01 00 03
const uint8_t g_tuya_heartbeat2[8]={0x55,0xAA,0x03,0x00,0x00,0x01,0x01,0x04};//心跳检测,第2次 0x55 aa 00 00 00 01 01 04
const uint8_t g_tuya_wifi_cfg[8]={0x55,0xAA,0x03,0x05,0x00,0x01,0x01,0x09};//WIFI配网
//0x55, 0xAA, 0x03, 0x01 (帧头)
//0x00, 0x2A       (长度)
//0x7B, 0x22, 0x70, 0x22, 0x3A, 0x22 ({"p":")
//0x36, 0x33, 0x70, 0x6E, 0x66, 0x69, 0x72, 0x6D, 0x72, 0x73, 0x6C, 0x78, 0x74, 0x75, 0x72, 0x38 (63pnfirmrslxtur8)
//20x22, 0x2C, 0x22, 0x76, 0x22, 0x3A, 0x22 (","v":")
//0x31, 0x2E, 0x30, 0x2E, 0x30  (1.0.0)
//0x22, 0x2C, 0x22, 0x6D, 0x22, 0x3A (","m":)
//0x30  (0)
//0x7D(})
//0x40(校验码)
uint8_t g_tuya_product_info[49]={
0x55, 0xAA, 0x03, 0x01,
0x00, 0x2A,
0x7B, 0x22, 0x70, 0x22, 0x3A, 0x22,
0x36, 0x33, 0x70, 0x6E, 0x66, 0x69, 0x72, 0x6D, 0x72, 0x73, 0x6C, 0x78, 0x74, 0x75, 0x72, 0x38,
0x22, 0x2C, 0x22, 0x76, 0x22, 0x3A, 0x22,
0x31, 0x2E, 0x30, 0x2E, 0x30,
0x22, 0x2C, 0x22, 0x6D, 0x22, 0x3A,
0x30,
0x7D,
0x40

};//接收模块发送的查询产品信息请求

const uint8_t g_tuya_query_mode[8]={0x55,0xaa,0x03,0x02,0x00,0x00,0x04};//查询工作模式
uint32_t wifi_ap_num =0;//wifi重置计时
const uint8_t g_tuya_rpt_net[8]={0x55,0xaa,0x03,0x03,0x00,0x00,0x05};//报告设备联网状态
uint32_t wifi_Update=0;//wifi发送标志位
uint32_t g_tuya_up_data=0;//定时上报计时
uint8_t g_tuya_mode_flag=0;//wifi模式，4的时候链接上网
uint8_t bat=0;//电池电量
uint8_t g_tuya_dp_bat[15]={0x55,0xAA,0x03,0x07,0x00,0x08,0x03,0x02,0x00,0x04,0x00,0x00,0x00,0x00,0x1A};//MCU上报电量

uint8_t up_down=0;//震动
uint8_t g_tuya_dp_tap[12]={0x55,0xAA,0x03,0x07,0x00,0x05,0x0A,0x04,0x00,0x01,0x00,0x1D};//MCU上报状态

uint16_t temp_tuya=0;//温度
uint8_t g_tuya_dp_temp[15]={0x55,0xAA,0x03,0x07,0x00,0x08,0x08,0x02,0x00,0x04,0x00,0x00,0x00,0x00,0x1F};//MCU上报稳定


fsp_err_t err = FSP_SUCCESS;
volatile bool uart_send_complete_flag = false;
void user_uart_callback (uart_callback_args_t * p_args)
{
    if(p_args->event == UART_EVENT_TX_COMPLETE)
    {
        uart_send_complete_flag = true;
    }
}

#ifdef __GNUC__                                 //串口重定向
    #define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
    #define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif


PUTCHAR_PROTOTYPE
{
        err = R_SCI_UART_Write(&g_uart9_ctrl, (uint8_t *)&ch, 1);
        if(FSP_SUCCESS != err) __BKPT();
        while(uart_send_complete_flag == false){}
        uart_send_complete_flag = false;
        return ch;
}

int _write(int fd,char *pBuffer,int size)
{
    for(int i=0;i<size;i++)
    {
        __io_putchar(*pBuffer++);
    }
    return size;
}

/* Callback function */
i2c_master_event_t i2c_event = I2C_MASTER_EVENT_ABORTED;
uint32_t  timeout_ms = 100000;
void sci_i2c_master_callback(i2c_master_callback_args_t *p_args)
{
    i2c_event = I2C_MASTER_EVENT_ABORTED;
    if (NULL != p_args)
    {
        /* capture callback event for validating the i2c transfer event*/
        i2c_event = p_args->event;
    }
}

#define SENSOR_BUS g_i2c2_ctrl

/* Private macro -------------------------------------------------------------*/
#define    BOOT_TIME            10 //ms

/* Private variables ---------------------------------------------------------*/
static uint8_t whoamI;
static uint8_t tx_buffer[1000];

static lsm6dsv16x_interrupt_mode_t irq;
static lsm6dsv16x_tap_detection_t tap;
static lsm6dsv16x_tap_thresholds_t tap_ths;
static lsm6dsv16x_tap_time_windows_t tap_win;

/* Extern variables ----------------------------------------------------------*/
lsm6dsv16x_all_sources_t status;
lsm6dsv16x_pin_int_route_t pin_int;
lsm6dsv16x_reset_t rst;
/* Private functions ---------------------------------------------------------*/
/*
 *   WARNING:
 *   Functions declare in this section are defined at the end of this file
 *   and are strictly related to the hardware platform used.
 *
 */
static int32_t platform_write(void *handle, uint8_t reg, const uint8_t *bufp,
                              uint16_t len);
static int32_t platform_read(void *handle, uint8_t reg, uint8_t *bufp,
                             uint16_t len);
static void tx_com( uint8_t *tx_buffer, uint16_t len );
static void platform_delay(uint32_t ms);
static void platform_init(void *handle);

static stmdev_ctx_t dev_ctx;
static uint8_t stap_event_catched = 0;
static uint8_t dtap_event_catched = 0;

bool irq_flag =0;
/* Called from icu_irq_isr */
void external_irq6_callback (external_irq_callback_args_t * p_args)
{
    (void) p_args;
    irq_flag = 1;
}

static void sensor_lsm6dsv16x_tap_init(void)
{
    // 配置传感器设备操作函数（读、写、延时），并指定 I2C 句柄
    dev_ctx.write_reg = platform_write;
    dev_ctx.read_reg = platform_read;
    dev_ctx.mdelay = platform_delay;
    dev_ctx.handle = &SENSOR_BUS;
    // 上电后延时，等待传感器稳定
    platform_delay(BOOT_TIME);
    // 读取芯片 ID，并打印，用于识别传感器是否连接正确
    lsm6dsv16x_device_id_get(&dev_ctx, &whoamI);
    printf("LSM6DSV16X_ID=0x%x, whoamI=0x%x\n", LSM6DSV16X_ID, whoamI);
    if (whoamI != LSM6DSV16X_ID) while (1);// 若芯片 ID 不匹配，则停留在此处
    // 若芯片 ID 不匹配，则停留在此处
    lsm6dsv16x_reset_set(&dev_ctx, LSM6DSV16X_RESTORE_CTRL_REGS);
    // 等待复位完成
    do {
        lsm6dsv16x_reset_get(&dev_ctx, &rst);
    } while (rst != LSM6DSV16X_READY);
    // 使能 Block Data Update，防止数据在读取时被更新
    lsm6dsv16x_block_data_update_set(&dev_ctx, PROPERTY_ENABLE);
    // 配置将“单击”和“双击”事件路由至 INT1 引脚
    pin_int.double_tap = PROPERTY_ENABLE;
    pin_int.single_tap = PROPERTY_ENABLE;
    lsm6dsv16x_pin_int1_route_set(&dev_ctx, &pin_int);
    // 配置中断输出方式：使能功能中断，关闭锁存模式（脉冲输出）
    irq.enable = 1;
    irq.lir = 0;
    lsm6dsv16x_interrupt_enable_set(&dev_ctx, irq);
    // 启用 Z 轴 Tap 检测（仅检测 Z 轴）
    tap.tap_z_en = 1;
    lsm6dsv16x_tap_detection_set(&dev_ctx, tap);
    // 设置 Tap 阈值，单位为 LSB（3 LSB ≈ 186mg @ ±8g）
    tap_ths.z = 3;
    lsm6dsv16x_tap_thresholds_set(&dev_ctx, tap_ths);
    // 设置 Tap 时间窗口（用于识别单击/双击时的时间控制）
    tap_win.tap_gap = 7;
    tap_win.shock = 3;
    tap_win.quiet = 3;
    lsm6dsv16x_tap_time_windows_set(&dev_ctx, tap_win);
    // 启用双击和单击检测模式
    lsm6dsv16x_tap_mode_set(&dev_ctx, LSM6DSV16X_BOTH_SINGLE_DOUBLE);
    // 设置加速度计工作参数：480Hz 采样率
    lsm6dsv16x_xl_data_rate_set(&dev_ctx, LSM6DSV16X_ODR_AT_480Hz);
    // 设置加速度计量程为 ±8g（灵敏度和范围的折中）
    lsm6dsv16x_xl_full_scale_set(&dev_ctx, LSM6DSV16X_8g);
}

static void app_peripheral_init(void)
{
    // 点亮板载 LED（用于上电指示）
    R_IOPORT_PinWrite(&g_ioport_ctrl, BSP_IO_PORT_01_PIN_04, BSP_IO_LEVEL_HIGH);
    //LIS2MDL CS2->1
    R_IOPORT_PinWrite(&g_ioport_ctrl, BSP_IO_PORT_00_PIN_02, BSP_IO_LEVEL_HIGH);
    //LSM6DSV16X CS1->1
    R_IOPORT_PinWrite(&g_ioport_ctrl, BSP_IO_PORT_01_PIN_02, BSP_IO_LEVEL_HIGH);

    // 初始化串口 UART9
    err = R_SCI_UART_Open(&g_uart9_ctrl, &g_uart9_cfg);
    assert(FSP_SUCCESS == err);
    // 发送初始字符串用于串口测试
    char *msg = "RA E2STUDIO";
    err = R_SCI_UART_Write(&g_uart9_ctrl, (uint8_t *)msg, strlen(msg));
    if (FSP_SUCCESS != err) __BKPT();
    while (!uart_send_complete_flag) {}
    uart_send_complete_flag = false;
    // 打印欢迎信息
    printf("\nhello world!\r\n");
    // 初始化 I2C 控制器
    err = R_SCI_I2C_Open(&g_i2c2_ctrl, &g_i2c2_cfg);
    assert(FSP_SUCCESS == err);
    // 打开外部中断通道（用于接收 LSM6DSV16X 的中断输出）
    err = R_ICU_ExternalIrqOpen(&g_external_irq6_ctrl, &g_external_irq6_cfg);
    assert(FSP_SUCCESS == err);
    // 使能外部中断通道
    err = R_ICU_ExternalIrqEnable(&g_external_irq6_ctrl);
    assert(FSP_SUCCESS == err);

    // 初始化串口 UART0
    err = R_SCI_UART_Open(&g_uart0_ctrl, &g_uart0_cfg);
    assert(FSP_SUCCESS == err);
}

