CoreMaker-lab/RA4M2_IOT/RA4M2_IOT_Project8/src/hal_entry.c
            /* ---------------- 温度数据上传 ---------------- */
            int16_t data_raw_temperature;
            double_t temperature_degC;
            /* Read temperature data */
              memset(&data_raw_temperature, 0x00, sizeof(int16_t));// 清空原始数据缓存
              // 读取 LSM6DSV16X 的原始温度数据
              lsm6dsv16x_temperature_raw_get(&dev_ctx, &data_raw_temperature);
              // 将原始 LSB 数据转换为摄氏温度
              temperature_degC = lsm6dsv16x_from_lsb_to_celsius(
                                   data_raw_temperature);
              // 扩大10倍为整数（单位 0.1°C）方便打包进两个字节
              temp_tuya = temperature_degC * 10;

              g_tuya_dp_temp[12] = temp_tuya / 255;  // 高字节
              g_tuya_dp_temp[13] = temp_tuya % 255;  // 低字节

              g_tuya_dp_temp[14] = 0;  // 清空校验和
              // 计算校验和
              for(int i=0;i<=13;i++)
                  g_tuya_dp_temp[14]+=g_tuya_dp_temp[i];
              // 串口打印温度信息
              printf("[MCU] -> TUYA DP_tEMP = %6.2f\r\n",temperature_degC);
              // 通过 UART 发送温度数据给涂鸦模块
              err = R_SCI_UART_Write(&g_uart0_ctrl, g_tuya_dp_temp, 15);
              if(FSP_SUCCESS != err) __BKPT();
              while(uart_wifi_TX_flag == false){}
              uart_wifi_TX_flag = false;

//              printf("Temperature [degC]:%6.2f\r\n", temperature_degC);
        }
    }
}

// OLED 屏幕启动函数：完成初始化、清屏、颜色/方向配置
static void OLED_Start(void)
{
    OLED_Init();              // 初始化 OLED 屏幕（发送初始化命令序列，设置工作模式）
    OLED_Clear();             // 清空显存（OLED_GRAM），并刷新，使屏幕全黑
    OLED_ColorTurn(0);        // 设置显示颜色模式：0 为正常显示，1 为反色显示（黑白反转）
    OLED_DisplayTurn(0);      // 设置显示方向：0 为正常方向，1 为上下翻转显示

    OLED_Clear();//清空 OLED 显存
    OLED_ShowChinese(0,0,0,16,1);//在坐标 (0,0) 显示 Hzk1[0]，即汉字“瑞”，正显
    OLED_ShowChinese(16,0,1,16,1);//在坐标 (16,0) 显示 Hzk1[1]，即汉字“萨”，正显
    OLED_ShowChinese(32,0,2,16,0);//在坐标 (32,0) 显示 Hzk1[2]，即汉字“单”，反色
    OLED_ShowChinese(48,0,3,16,0);//在坐标 (48,0) 显示 Hzk1[3]，即汉字“片”，反色
    OLED_ShowChinese(64,0,4,16,0);//在坐标 (64,0) 显示 Hzk1[4]，即汉字“机”，反色
    OLED_Refresh();//将上述通过 OLED_ShowChinese() 写入 OLED_GRAM[][] 的内容，批量发送到 OLED 屏幕显示。如果没有调用这个函数，屏幕上不会出现任何内容（即写入显存但未更新）。

    OLED_ShowNum(0, 16, 20250615, 8, 16, 1);//在坐标 (0,16) 显示20250615，长度8，字体16，正显
    OLED_ShowString(84, 16, "RA4M2", 16, 1);//在坐标 (84,16) 显示RA4M2，字体16，正显
    OLED_Refresh();// 将 OLED_GRAM 显存内容刷新到 OLED 屏幕上，显示数字和字符串

    OLED_ShowPicture(0, 32, 117, 19, BMP3, 1);                // 在 OLED 屏幕的 (x=0, y=32) 位置显示一张宽 117、高 19 像素的图片 BMP3，正常模式显示
    OLED_Refresh();                                           // 将图片内容从缓冲区刷新到 OLED 屏幕上，真正显示出来
    R_BSP_SoftwareDelay(200, BSP_DELAY_UNITS_MILLISECONDS);  // 延时 200 毫秒
}
/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    /* TODO: add your own code here */

    // 初始化外设（如 UART、I2C、中断引脚、GPIO 等）
    app_peripheral_init();
    // 初始化 LSM6DSV16X 传感器，配置单击/双击 Tap 检测功能
    sensor_lsm6dsv16x_tap_init();
    // 初始化 OLED,保证屏幕点亮且处于默认显示状态
    OLED_Start();
    while (1)
    {
        // 处理 LSM6DSV16X 的 Tap 检测事件（单击/双击），并串口打印
        sensor_lsm6dsv16x_tap_loop();

        // 处理涂鸦协议状态更新（例如心跳、连接状态等）
        tuya_wifi_Update();

        // 检查按键是否触发 Wi-Fi 配网模式（例如长按按键进入配网）
        button_wifi_ap();

        // 解析 UART 接收的涂鸦协议数据帧（如收到APP指令等）
        uart0_tuya();

        // 每 2000ms 上传一次传感器数据（电量、温度）到涂鸦模块
        tuya_up_data();

        // 软件延时 1ms，控制循环节奏（相当于每 1ms 执行一次）
        R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MILLISECONDS);
    }
#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}


/*
 * @brief  Write generic device register (platform dependent)
 *
 * @param  handle    customizable argument. In this examples is used in
 *                   order to select the correct sensor bus handler.
 * @param  reg       register to write
 * @param  bufp      pointer to data to write in register reg
 * @param  len       number of consecutive register to write
 *
 */
static int32_t platform_write(void *handle, uint8_t reg, const uint8_t *bufp,uint16_t len)
{
    R_SCI_I2C_SlaveAddressSet(&g_i2c2_ctrl, 0x6B, I2C_MASTER_ADDR_MODE_7BIT);
    assert(FSP_SUCCESS == err);
    // 创建一个足够大的缓冲区来包含寄存器地址和数据
    uint8_t data[len + 1];
    data[0] = reg; // 将寄存器地址放在数据的开始
    memcpy(&data[1], bufp, len); // 复制数据到缓冲区

    err = R_SCI_I2C_Write(&g_i2c2_ctrl, data, len+1, true);
    assert(FSP_SUCCESS == err);
    /* Since there is nothing else to do, block until Callback triggers*/
    //while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms)
    while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms>0)
    {
        R_BSP_SoftwareDelay(1U, BSP_DELAY_UNITS_MICROSECONDS);
        timeout_ms--;
        }
    if (I2C_MASTER_EVENT_ABORTED == i2c_event)
    {
        __BKPT(0);
    }
    /* Read data back from the I2C slave */
    i2c_event = I2C_MASTER_EVENT_ABORTED;
    timeout_ms           = 100000;
    return 0;
}


/*
 * @brief  Read generic device register (platform dependent)
 *
 * @param  handle    customizable argument. In this examples is used in
 *                   order to select the correct sensor bus handler.
 * @param  reg       register to read
 * @param  bufp      pointer to buffer that store the data read
 * @param  len       number of consecutive register to read
 *
 */
static int32_t platform_read(void *handle, uint8_t reg, uint8_t *bufp,uint16_t len)
{
    R_SCI_I2C_SlaveAddressSet(&g_i2c2_ctrl, 0x6B, I2C_MASTER_ADDR_MODE_7BIT);
    assert(FSP_SUCCESS == err);
    err = R_SCI_I2C_Write(&g_i2c2_ctrl, &reg, 1, true);
    assert(FSP_SUCCESS == err);
    /* Since there is nothing else to do, block until Callback triggers*/
    //while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms)
    while ((I2C_MASTER_EVENT_TX_COMPLETE != i2c_event) && timeout_ms>0)
    {
        R_BSP_SoftwareDelay(1U, BSP_DELAY_UNITS_MICROSECONDS);
        timeout_ms--;
        }
    if (I2C_MASTER_EVENT_ABORTED == i2c_event)
    {
        __BKPT(0);
        }
    /* Read data back from the I2C slave */
    i2c_event = I2C_MASTER_EVENT_ABORTED;
    timeout_ms           = 100000;

    /* Read data from I2C slave */
    err = R_SCI_I2C_Read(&g_i2c2_ctrl, bufp, len, false);
    assert(FSP_SUCCESS == err);
    while ((I2C_MASTER_EVENT_RX_COMPLETE != i2c_event) && timeout_ms)
    {
        R_BSP_SoftwareDelay(1U, BSP_DELAY_UNITS_MILLISECONDS);
        timeout_ms--;
    }
    if (I2C_MASTER_EVENT_ABORTED == i2c_event)
    {
        __BKPT(0);
    }

    i2c_event = I2C_MASTER_EVENT_ABORTED;
    timeout_ms           = 100000;
  return 0;
}


